etp-backend/src/main/resources/asha/case-create.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageHeader xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:messageVersion>1.0</ns0:messageVersion>
            <ns0:requestId>{{request-id}}</ns0:requestId>
            <ns0:senderId>{{sender-id}}</ns0:senderId>
        </ns0:MessageHeader>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:createECase xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:createCaseOperation>
                <ns0:classification>
                    <ns0:code>{{classification}}</ns0:code>
                </ns0:classification>
                <ns0:service>{{service}}</ns0:service>
                <ns0:name>{{name}}</ns0:name>
                <ns0:description>{{description}}</ns0:description>
            </ns0:createCaseOperation>
        </ns0:createECase>
    </soap-env:Body>
</soap-env:Envelope>
